
             #1st program
print(9**0.5*5)
             #2nd program
print(9.9>9.8 and 1000 != 1000.1)
             #3rd program
a = 1234
#print(a%1000//10) неверный первоначальный вариант
a1 = a%1000//10
b = 5678
#print(b%1000//10) неверный первоначальный вариант
b1 = b%1000//10
print(a1+b1)
             #4th program"
a = 13.42
a1 = (a//1)#Целая часть 1-го числа
#print(a1)
a2 = round((a%1),2)*100#Дробная часть 1-го числа
#print(a2)
b = 42.13
b1 = (b//1)#Целая часть 2-го числа
#print(b1)
b2 = round((b%1),2)*100#Дробная часть 2-го числа
#print(b2)
print(a1 == b2 or b1 == a2)
